xml/doctor.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" signAlgorithm="urn:ietf:params:xml:ns:cpxmlsec:algorithms:gostr34102012-gostr34112012-256">
    <soapenv:Header>
        <wsse:Security soapenv:actor="http://eln.fss.ru/actor/doc/910334633251_3_doc">
            <wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="http://eln.fss.ru/actor/doc/910334633251_3_doc">MIIKcTCCCh6gAwIBAgIRAKCCPjPxYGKFsyFENBACqLgwCgYIKoUDBwEBAwIwggFhMSAwHgYJKoZI
                hvcNAQkBFhF1Y19ma0Byb3NrYXpuYS5ydTEYMBYGA1UECAwPNzcg0JzQvtGB0LrQstCwMRUwEwYF
                KoUDZAQSCjc3MTA1Njg3NjAxGDAWBgUqhQNkARINMTA0Nzc5NzAxOTgzMDFgMF4GA1UECQxX0JHQ
                vtC70YzRiNC+0Lkg0JfQu9Cw0YLQvtGD0YHRgtC40L3RgdC60LjQuSDQv9C10YDQtdGD0LvQvtC6
                LCDQtC4gNiwg0YHRgtGA0L7QtdC90LjQtSAxMRkwFwYDVQQHDBDQsy4g0JzQvtGB0LrQstCwMQsw
                CQYDVQQGEwJSVTEuMCwGA1UECgwl0JrQsNC30L3QsNGH0LXQudGB0YLQstC+INCg0L7RgdGB0LjQ
                uDE4MDYGA1UEAwwv0KTQtdC00LXRgNCw0LvRjNC90L7QtSDQutCw0LfQvdCw0YfQtdC50YHRgtCy
                0L4wHhcNMjUwMTIzMTExNzM2WhcNMjYwNDE4MTExNzM2WjCCAzQxCzAJBgNVBAYTAlJVMSowKAYD
                VQQIDCHQsy4g0KHQsNC90LrRgi3Qn9C10YLQtdGA0LHRg9GA0LMxKDAmBgNVBAkMH9GD0LsuINCa
                0YPQudCx0YvRiNC10LLQsCwg0LQuMjUxKjAoBgNVBAcMIdCzLiDQodCw0L3QutGCLdCf0LXRgtC1
                0YDQsdGD0YDQszEgMB4GA1UEDAwX0JPQu9Cw0LLQvdGL0Lkg0LLRgNCw0YcxgdgwgdUGA1UECgyB
                zdCh0JDQndCa0KIt0J/QldCi0JXQoNCR0KPQoNCT0KHQmtCe0JUg0JPQntCh0KPQlNCQ0KDQodCi
                0JLQldCd0J3QntCVINCR0K7QlNCW0JXQotCd0J7QlSDQo9Cn0KDQldCW0JTQldCd0JjQlSDQl9CU
                0KDQkNCS0J7QntCl0KDQkNCd0JXQndCY0K8gItCU0JXQotCh0JrQkNCvINCT0J7QoNCe0JTQodCa
                0JDQryDQn9Ce0JvQmNCa0JvQmNCd0JjQmtCQIOKEliAxOSIxGDAWBgUqhQNkARINMTAzNzgyODAw
                MjQ0MjEWMBQGBSqFA2QDEgswNzIyNzM4MDI1NDEVMBMGBSqFA2QEEgo3ODEzMTAzNDQ2MRowGAYI
                KoUDA4EDAQESDDc4MDIxMDc0NDA0NTEjMCEGCSqGSIb3DQEJARYUcGQxOS5pdEB6ZHJhdi5zcGIu
                cnUxKjAoBgNVBCoMIdCS0LDQu9C10YDQuNC5INCd0L7QtNCw0YDQvtCy0LjRhzEVMBMGA1UEBAwM
                0JrQvtC60L7QtdCyMYHYMIHVBgNVBAMMgc3QodCQ0J3QmtCiLdCf0JXQotCV0KDQkdCj0KDQk9Ch
                0JrQntCVINCT0J7QodCj0JTQkNCg0KHQotCS0JXQndCd0J7QlSDQkdCu0JTQltCV0KLQndCe0JUg
                0KPQp9Cg0JXQltCU0JXQndCY0JUg0JfQlNCg0JDQktCe0J7QpdCg0JDQndCV0J3QmNCvICLQlNCV
                0KLQodCa0JDQryDQk9Ce0KDQntCU0KHQmtCQ0K8g0J/QntCb0JjQmtCb0JjQndCY0JrQkCDihJYg
                MTkiMGYwHwYIKoUDBwEBAQEwEwYHKoUDAgIkAAYIKoUDBwEBAgIDQwAEQBoAQ7VWuRV7JWsI6/vZ
                3dApfePXlTN6RmiiIj+xLDazkK5JUu1nOfJ90z8vbl8X27BCdYJNYV5Ir1DVImeCh8OjggTRMIIE
                zTArBgNVHRAEJDAigA8yMDI1MDEyMzE0MjAwMFqBDzIwMjYwNDE4MTQyMDAwWjAOBgNVHQ8BAf8E
                BAMCA/gwEwYDVR0lBAwwCgYIKwYBBQUHAwIwHQYDVR0gBBYwFDAIBgYqhQNkcQEwCAYGKoUDZHEC
                MAwGBSqFA2RyBAMCAQEwLQYFKoUDZG8EJAwi0JrRgNC40L/RgtC+0J/RgNC+IENTUCAoNS4wLjEy
                MzMwKTCCAaEGBSqFA2RwBIIBljCCAZIMgYfQn9GA0L7Qs9GA0LDQvNC80L3Qvi3QsNC/0L/QsNGA
                0LDRgtC90YvQuSDQutC+0LzQv9C70LXQutGBIFZpUE5ldCBQS0kgU2VydmljZSAo0L3QsCDQsNC/
                0L/QsNGA0LDRgtC90L7QuSDQv9C70LDRgtGE0L7RgNC80LUgSFNNIDIwMDBRMikMaNCf0YDQvtCz
                0YDQsNC80LzQvdC+LdCw0L/Qv9Cw0YDQsNGC0L3Ri9C5INC60L7QvNC/0LvQtdC60YEgwqvQrtC9
                0LjRgdC10YDRgi3Qk9Ce0KHQosK7LiDQktC10YDRgdC40Y8gNC4wDE1D0LXRgNGC0LjRhNC40LrQ
                sNGCINGB0L7QvtGC0LLQtdGC0YHRgtCy0LjRjyDihJbQodCkLzEyNC00MzI4INC+0YIgMjkuMDgu
                MjAyMgxNQ9C10YDRgtC40YTQuNC60LDRgiDRgdC+0L7RgtCy0LXRgtGB0YLQstC40Y8g4oSW0KHQ
                pC8xMjgtNDYzOSDQvtGCIDA0LjEwLjIwMjMwZgYDVR0fBF8wXTAuoCygKoYoaHR0cDovL2NybC5y
                b3NrYXpuYS5ydS9jcmwvdWNma18yMDI0LmNybDAroCmgJ4YlaHR0cDovL2NybC5may5sb2NhbC9j
                cmwvdWNma18yMDI0LmNybDB3BggrBgEFBQcBAQRrMGkwNAYIKwYBBQUHMAKGKGh0dHA6Ly9jcmwu
                cm9za2F6bmEucnUvY3JsL3VjZmtfMjAyNC5jcnQwMQYIKwYBBQUHMAKGJWh0dHA6Ly9jcmwuZmsu
                bG9jYWwvY3JsL3VjZmtfMjAyNC5jcnQwHQYDVR0OBBYEFPPzT+5PLsls1D/qI2yuM5vUbXbMMIIB
                dgYDVR0jBIIBbTCCAWmAFAZkE6fO4IPipn2fiafWVhmYTNmnoYIBQ6SCAT8wggE7MSEwHwYJKoZI
                hvcNAQkBFhJkaXRAZGlnaXRhbC5nb3YucnUxCzAJBgNVBAYTAlJVMRgwFgYDVQQIDA83NyDQnNC+
                0YHQutCy0LAxGTAXBgNVBAcMENCzLiDQnNC+0YHQutCy0LAxUzBRBgNVBAkMStCf0YDQtdGB0L3Q
                tdC90YHQutCw0Y8g0L3QsNCx0LXRgNC10LbQvdCw0Y8sINC00L7QvCAxMCwg0YHRgtGA0L7QtdC9
                0LjQtSAyMSYwJAYDVQQKDB3QnNC40L3RhtC40YTRgNGLINCg0L7RgdGB0LjQuDEYMBYGBSqFA2QB
                Eg0xMDQ3NzAyMDI2NzAxMRUwEwYFKoUDZAQSCjc3MTA0NzQzNzUxJjAkBgNVBAMMHdCc0LjQvdGG
                0LjRhNGA0Ysg0KDQvtGB0YHQuNC4ggpsCcB2AAAAAAmMMAoGCCqFAwcBAQMCA0EA8Lw4UH8bpdPz
                aOrSitzn2EmeqLGgASVNfjeWruw6tgNzDAQ3CQ+qNSjSfDXfiO2eMtHbumRy2y0QfQPJd9CCwA==
            </wsse:BinarySecurityToken>
            <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                <ds:SignedInfo>
                    <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                    <ds:SignatureMethod Algorithm="urn:ietf:params:xml:ns:cpxmlsec:algorithms:gostr34102012-gostr34112012-256"/>
                    <ds:Reference URI="#ELN_910334633251_3_doc">
                        <ds:Transforms>
                            <ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
                            <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                        </ds:Transforms>
                        <ds:DigestMethod Algorithm="urn:ietf:params:xml:ns:cpxmlsec:algorithms:gostr34112012-256"/>
                        <ds:DigestValue>Sz/ppdYOGu+GjtDEhlvF1hqcGmOi7Qgo5b2+nOlVghc=</ds:DigestValue>
                    </ds:Reference>
                </ds:SignedInfo>
                <ds:SignatureValue>0kuZ3lku0Ot/BF6TjvMz4RLanK1uikkp/jxWXq1eQocUiYsjrZKDd2GiAAU38HzPzH+rnaeLtzEWiSymRrg0CQ==</ds:SignatureValue>
                <ds:KeyInfo>
                    <wsse:SecurityTokenReference>
                        <wsse:Reference URI="#http://eln.fss.ru/actor/doc/910334633251_3_doc" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"/>
                    </wsse:SecurityTokenReference>
                </ds:KeyInfo>
            </ds:Signature>
        </wsse:Security>
        <wsse:Security soapenv:actor="http://eln.fss.ru/actor/mo/1037828002442/ELN_910334633251">
            <wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="http://eln.fss.ru/actor/mo/1037828002442/ELN_910334633251">{certmo}</wsse:BinarySecurityToken>
        </wsse:Security>
        <ds:X509Certificate>{certmo}</ds:X509Certificate>
    </soapenv:Header>
    <soapenv:Body>
        <prParseFilelnlpuRequest xmlns="http://www.fss.ru/integration/types/eln/mo/v01">
            <ogrn>1037828002442</ogrn>
            <pXmlFile>
                <rowset xmlns:ns0="http://www.fss.ru/integration/types/eln/v01" ns0:author="" ns0:email="" ns0:phone="" ns0:software="Виста-МЕД" ns0:version="2.0" ns0:version_software="043892">
                    <row wsu:Id="ELN_910334633251">
                        <unconditional>true</unconditional>
                        <writtenAgreementFlag>true</writtenAgreementFlag>
                        <lnCode>910334633251</lnCode>
                        <primaryFlag>1</primaryFlag>
                        <duplicateFlag>0</duplicateFlag>
                        <lpuOgrn>{current_ogrn}</lpuOgrn>
                        <gender>1</gender>
                        <reason1/>
                        <reason2/>
                        <diagnos>J06.9</diagnos>
                        <mseDt1 xsi:nil="true"/>
                        <mseDt2 xsi:nil="true"/>
                        <mseDt3 xsi:nil="true"/>
                        <mseInvalidGroup xsi:nil="true"/>
                        <date1 xsi:nil="true"/>
                        <date2 xsi:nil="true"/>
                        <snils>12728323049</snils>
                        <surname>АНДРЕЕВА</surname>
                        <name>ЮЛИЯ</name>
                        <patronymic>ВЛАДИМИРОВНА</patronymic>
                        <lnDate>2026-02-12</lnDate>
                        <lpuName>СПБ ГБУЗ "ДЕТСКАЯ ГОРОДСКАЯ ПОЛИКЛИНИКА №19"</lpuName>
                        <lpuAddress>197046, СПБ, УЛ.КУЙБЫШЕВА, Д.25</lpuAddress>
                        <birthday>1969-01-14</birthday>
                        <lnState>010</lnState>
                        <intermittentMethodFlag>false</intermittentMethodFlag>
                        <treatPeriods>
                            <treatFullPeriod>
                                <treatPeriod xmlns="http://www.fss.ru/integration/types/eln/v01" wsu:Id="ELN_910334633251_3_doc">
                                    <treatDt1>2026-02-12</treatDt1>
                                    <treatDt2>2026-02-16</treatDt2>
                                    <treatDoctorRole>ЛЕЧАЩИЙ ВРАЧ</treatDoctorRole>
                                    <treatDoctor>РАСПУТИН С В</treatDoctor>
                                    <idDoctor>19522575290</idDoctor>
                                </treatPeriod>
                            </treatFullPeriod>
                        </treatPeriods>
                        <servData>
                            <servFullData>
                                <ns0:servRelationCode>38</ns0:servRelationCode>
                                <ns0:servDt1>2026-02-12</ns0:servDt1>
                                <ns0:servDt2>2026-02-16</ns0:servDt2>
                                <ns0:treatmentType>1</ns0:treatmentType>
                                <ns0:surname>ХЛЕБНИКОВ</ns0:surname>
                                <ns0:name>МАТВЕЙ</ns0:name>
                                <ns0:patronymic>СЕРГЕЕВИЧ</ns0:patronymic>
                                <ns0:birthday>2023-05-16</ns0:birthday>
                                <ns0:reason1>09</ns0:reason1>
                                <ns0:snils>22189152864</ns0:snils>
                                <diagnosis>J06.9</diagnosis>
                            </servFullData>
                        </servData>
                    </row>
                </rowset>
            </pXmlFile>
        </prParseFilelnlpuRequest>
    </soapenv:Body>
</soapenv:Envelope>